MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG11B110F2048IQ64/mcu.h
  uint32_t       RESERVED17[3U];      /**< Reserved for future use **/
  __IM uint32_t  SYNCBUSY;            /**< Synchronization Busy Register  */
  __IOM uint32_t FREEZE;              /**< Freeze Register  */
  uint32_t       RESERVED18[2U];      /**< Reserved for future use **/
  __IOM uint32_t PCNTCTRL;            /**< PCNT Control Register  */

  uint32_t       RESERVED19[2U];      /**< Reserved for future use **/
  __IOM uint32_t ADCCTRL;             /**< ADC Control Register  */

  uint32_t       RESERVED20[4U];      /**< Reserved for future use **/
  __IOM uint32_t ROUTEPEN;            /**< I/O Routing Pin Enable Register  */
  __IOM uint32_t ROUTELOC0;           /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC1;           /**< I/O Routing Location Register  */
  uint32_t       RESERVED21[1U];      /**< Reserved for future use **/
  __IOM uint32_t LOCK;                /**< Configuration Lock Register  */
  __IOM uint32_t HFRCOSS;             /**< HFRCO Spread Spectrum Register  */
} CMU_TypeDef;                        /** @} */

// #include "efm32gg11b_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_ebi.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_prs_ch.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG11B110F2048IQ64_PRS PRS
 * @{
 * @brief EFM32GG11B110F2048IQ64_PRS Register Declaration
 ******************************************************************************/
/** PRS Register Declaration */
typedef struct {
  __IOM uint32_t SWPULSE;       /**< Software Pulse Register  */
  __IOM uint32_t SWLEVEL;       /**< Software Level Register  */
  __IOM uint32_t ROUTEPEN;      /**< I/O Routing Pin Enable Register  */
  uint32_t       RESERVED0[1U]; /**< Reserved for future use **/
  __IOM uint32_t ROUTELOC0;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC1;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC2;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC3;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC4;     /**< I/O Routing Location Register  */
  __IOM uint32_t ROUTELOC5;     /**< I/O Routing Location Register  */
  uint32_t       RESERVED1[2U]; /**< Reserved for future use **/
  __IOM uint32_t CTRL;          /**< Control Register  */
  __IOM uint32_t DMAREQ0;       /**< DMA Request 0 Register  */
  __IOM uint32_t DMAREQ1;       /**< DMA Request 1 Register  */
  uint32_t       RESERVED2[1U]; /**< Reserved for future use **/
  __IM uint32_t  PEEK;          /**< PRS Channel Values  */

  uint32_t       RESERVED3[3U]; /**< Reserved registers */
  PRS_CH_TypeDef CH[24U];       /**< Channel registers */
} PRS_TypeDef;                  /** @} */

// #include "efm32gg11b_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_can_mir.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_can.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_idac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_csen.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg11b_etm.h"  // Note: Changed for MikroE implementation.

/***************************************************************************//**
 * @defgroup EFM32GG11B110F2048IQ64_SMU SMU
 * @{
 * @brief EFM32GG11B110F2048IQ64_SMU Register Declaration
 ******************************************************************************/
/** SMU Register Declaration */
typedef struct {
  uint32_t       RESERVED0[3U];  /**< Reserved for future use **/
  __IM uint32_t  IF;             /**< Interrupt Flag Register  */
  __IOM uint32_t IFS;            /**< Interrupt Flag Set Register  */
  __IOM uint32_t IFC;            /**< Interrupt Flag Clear Register  */
  __IOM uint32_t IEN;            /**< Interrupt Enable Register  */

